Taurus.yml
---
modules:
  jmeter:
    detect-plugins: false
  blazemeter:
    # No token specified then the report is run as anonymous on BlazeMeter; creates a generic report name "external"
    # BLZM Token creates the BlazeMeter report under the Default Account/WorkSpace per the specified project name
    token: MY_TOKEN # <BLZM API Key ID>:<BLZM API Key Secret>
    address: https://my-org.support.blazemeter.net # reporting service address
    data-address: https://data.blazemeter.com # data service address
    browser-open: none  # auto-open the report in browser, 
                        # can be "start", "end", "both", "none"
    send-interval: 30s   # send/pushes data each n-th second to BlazeMeter
    timeout: 5s # connect and request timeout for BlazeMeter API
    artifact-upload-size-limit: 5  # limit max size of file (in megabytes)
                                   # that goes into zip for artifact upload, 10 by default
    public-report: false  # set to true to create a public link to the report
    report-name: ECIF_PostmanCollection_April 2020 Release
    test: April2020Release_Test
    project: April2020Release_Project
    
settings:
  check-updates: false  # check for newer version of Taurus on startup
  
execution:
- executor: jmeter
  concurrency: 1  #3
  ramp-up: 30s
  hold-for: 3m30s
  scenario: s1

scenarios:
  s1:
    script: April2020Release.jmx
  
reporting:
- module: final-stats
  dump-xml: stats.xml
  dump-csv: Jmeter_Result.csv

provisioning: cloud